{
  "Linguistik": {
    "TK": {
      "anak": [
        {
          "aktivitas": "Tebak Kata dari Deskripsi",
          "tujuan": "Mengukur kemampuan pemahaman verbal, perbendaharaan kata, dan inferensi semantik.",
          "bahan": "Kartu gambar objek/hewan/konsep yang relevan dengan deskripsi.",
          "instruksi": "Kita akan bermain tebak-tebakan kata. Aku akan memberitahumu beberapa hal tentang sesuatu, lalu kamu tebak itu apa. Siap? Oke, dengarkan baik-baik: 'Aku punya empat kaki, suka makan rumput, dan menghasilkan susu. Aku sering ditemukan di peternakan.' Siapakah aku?\" (Jika anak kesulitan, berikan 1-2 petunjuk tambahan, misal: \"Aku berbunyi 'mooo'.\") Berikan 3-5 pertanyaan serupa.",
          "rubrik": {
            "1": "Sulit Menebak",
            "2": "Perlu Petunjuk/Waktu",
            "3": "Tepat & Cepat"
          },
          "opsi_serupa": [
            {
              "nama": "Tebak Benda dari Deskripsi Detail",
              "deskripsi_aktivitas": "Asesor dan anak bermain tebak-tebakan benda. Asesor memberikan deskripsi detail tentang suatu objek di sekitar (misal: \"Aku sedang melihat sesuatu yang berwarna merah, bentuknya bulat, dan bisa dimakan. Apa itu?\"). Anak menebak benda tersebut. Bergantian peran jika memungkinkan.",
              "tujuan_opsi": "Mengembangkan kemampuan mendengarkan instruksi detail dan mengidentifikasi objek berdasarkan atribut."
            },
            {
              "nama": "Mengenali Suara & Menghubungkan Kata",
              "deskripsi_aktivitas": "Perdengarkan rekaman suara familiar (misal: suara anjing, klakson mobil, air mengalir). Minta anak menebak sumber suara dan mengucapkan kata benda yang relevan.",
              "tujuan_opsi": "Meningkatkan diskriminasi aural dan koneksi antara suara dan representasi verbal."
            }
          ]
        },
        {
          "aktivitas": "Melanjutkan Cerita Berantai",
          "tujuan": "Mengukur kemampuan narasi, koherensi ide, dan kreativitas verbal.",
          "bahan": "Tidak ada.",
          "instruksi": "Sekarang kita akan membuat cerita bersama. Aku akan memulai ceritanya, lalu kamu lanjutkan. Oke? Dengarkan: 'Pada suatu pagi yang cerah, ada seekor kelinci kecil bernama Lala. Lala sangat suka melompat. Dia melompat keluar dari rumahnya dan melihat...' Sekarang giliranmu, lanjutkan ceritanya!\" (Biarkan anak melanjutkan 2-3 kalimat. Jika diam, berikan dorongan ringan: \"Lalu apa yang Lala lihat/lakukan?\")",
          "rubrik": {
            "1": "Sulit Melanjutkan",
            "2": "Relevan tapi Sederhana",
            "3": "Kalimat Relevan & Runtut"
          },
          "opsi_serupa": [
            {
              "nama": "Menceritakan Kembali Gambar Berseri",
              "deskripsi_aktivitas": "Tunjukkan 3-4 kartu gambar yang membentuk alur cerita sederhana (tanpa teks). Minta anak untuk menceritakan kembali cerita tersebut secara berurutan.",
              "tujuan_opsi": "Mengukur kemampuan menyusun narasi berdasarkan urutan visual."
            },
            {
              "nama": "Mengembangkan Kalimat Acak",
              "deskripsi_aktivitas": "Asesor memberikan 2-3 kata acak (misal: \"kucing\", \"tidur\", \"pohon\"). Minta anak membuat satu kalimat utuh menggunakan semua kata tersebut.",
              "tujuan_opsi": "Melatih kemampuan menyusun kalimat kompleks dan pemahaman struktur bahasa."
            }
          ]
        },
        {
          "aktivitas": "Mengulang Kalimat",
          "tujuan": "Mengukur memori pendengaran jangka pendek, pemahaman sintaksis, dan artikulasi.",
          "bahan": "Tidak ada.",
          "instruksi": "Aku akan mengucapkan sebuah kalimat, lalu kamu ulangi persis seperti yang aku katakan. Oke? Dengarkan baik-baik.\" Berikan 3-5 kalimat dengan panjang bervariasi (mulai dari 5 kata, meningkat hingga 8-10 kata jika anak berhasil).\n\n* -Contoh Kalimat (5-7 kata): *\"Kelinci melompat cepat di taman.\" / \"Burung kecil itu terbang tinggi di langit biru.\"*\n* -Contoh Kalimat (8-10 kata): *\"Anak-anak bermain gembira di taman yang luas dan hijau.\" / \"Ibu sedang memasak kue cokelat yang sangat enak untuk kita.\"*",
          "rubrik": {
            "1": "Sulit Mengulang",
            "2": "Ada Kesalahan/Kurang Jelas",
            "3": "Akurat & Jelas"
          },
          "opsi_serupa": [
            {
              "nama": "Mengikuti Instruksi Multilangkah",
              "deskripsi_aktivitas": "Berikan 2-3 instruksi verbal secara berurutan. Misal: \"Ambil pensil merah, letakkan di meja, lalu tepuk tangan dua kali.\"",
              "tujuan_opsi": "Mengukur pemahaman instruksi verbal kompleks dan memori kerja."
            },
            {
              "nama": "Menirukan Urutan Bunyi (Fonem)",
              "deskripsi_aktivitas": "Asesor mengucapkan 2-3 rangkaian fonem/suku kata non-kata (misal: \"ba-bi-bu\", \"ta-ti-tu\"). Minta anak menirukan urutan tersebut.",
              "tujuan_opsi": "Mengukur diskriminasi fonemik dan memori auditori."
            }
          ]
        }
      ],
      "max_anak_score": 9
    },
    "ortu": [
      {
        "pertanyaan": "Apakah anak Anda suka mendengarkan cerita atau dongeng? Seberapa sering dia meminta Anda membacakan buku?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      },
      {
        "pertanyaan": "Apakah anak Anda suka berbicara, bercerita, atau bertanya banyak hal?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      },
      {
        "pertanyaan": "Apakah anak Anda mudah menghafal lagu atau sajak anak-anak?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      },
      {
        "pertanyaan": "Bagaimana kemampuan anak Anda dalam memahami instruksi atau petunjuk verbal yang kompleks?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      }
    ],
    "max_ortu_score": 4
  },
  "Logis-Matematis": {
    "TK": {
      "anak": [
        {
          "aktivitas": "Melanjutkan Pola Gambar",
          "tujuan": "Mengukur kemampuan pengenalan pola, berpikir sekuensial, dan penalaran logis.",
          "bahan": "Kartu gambar dengan pola sederhana (misal: A-B-A-B, A-A-B-A-A-B, atau A-B-C-A-B-C). Sediakan juga kartu elemen untuk melanjutkan pola.",
          "instruksi": "Lihat, ada gambar yang berurutan membuat pola. Bisakah kamu menebak gambar selanjutnya? Ini polanya: apel-pisang-apel-pisang-... (Berikan pilihan kartu apel/pisang). Apa selanjutnya?\" Berikan 3-5 pola yang bervariasi.",
          "rubrik": {
            "1": "Sulit Melanjutkan",
            "2": "Ada Kesalahan/Ragu",
            "3": "Tepat & Cepat"
          },
          "opsi_serupa": [
            {
              "nama": "Membuat Pola Konkret",
              "deskripsi_aktivitas": "Sediakan balok warna-warni/kancing/manik-manik. Minta anak untuk membuat pola sederhana (misal: merah-biru-merah-biru) dan menjelaskan polanya.",
              "tujuan_opsi": "Mengembangkan pemahaman pola secara konkret dan kemampuan verbalisasi pola."
            },
            {
              "nama": "Melanjutkan Pola Suara/Gerakan",
              "deskripsi_aktivitas": "Asesor membuat pola suara (misal: tepuk-jeda-tepuk-jeda) atau gerakan (misal: lompat-jongkok-lompat-jongkok). Anak diminta melanjutkannya.",
              "tujuan_opsi": "Mengukur kemampuan mengenali dan mereplikasi pola non-visual."
            }
          ]
        },
        {
          "aktivitas": "Menghitung Objek",
          "tujuan": "Mengukur kemampuan berhitung, korespondensi satu-satu, dan pemahaman kuantitas.",
          "bahan": "10-15 objek kecil yang identik (misal: kancing, balok).",
          "instruksi": "Mari kita hitung benda-benda ini. Bisakah kamu menghitung berapa banyak kancing yang ada di sini? Sentuh setiap kancing saat kamu menghitungnya.\" Mulai dengan 3-5 objek, tingkatkan menjadi 7-10 objek jika anak berhasil.",
          "rubrik": {
            "1": "Banyak Kesalahan",
            "2": "Beberapa Kesalahan",
            "3": "Benar Semua"
          },
          "opsi_serupa": [
            {
              "nama": "Mengambil Jumlah Tertentu",
              "deskripsi_aktivitas": "Sebar objek. Minta anak untuk mengambil sejumlah objek tertentu (misal: \"Tolong ambil 7 kancing dan letakkan di kotak ini\").",
              "tujuan_opsi": "Mengukur pemahaman angka dan kemampuan menghitung untuk mencapai target."
            },
            {
              "nama": "Mengidentifikasi Angka",
              "deskripsi_aktivitas": "Tunjukkan kartu angka (1-10) secara acak. Minta anak untuk menyebutkan angka tersebut.",
              "tujuan_opsi": "Mengukur pengenalan simbol numerik."
            }
          ]
        },
        {
          "aktivitas": "Membandingkan Jumlah",
          "tujuan": "Mengukur pemahaman konsep kuantitas relatif (\"lebih banyak\", \"lebih sedikit\", \"sama banyak\").",
          "bahan": "Dua kelompok objek identik dengan jumlah berbeda (misal: Kelompok A: 3 kancing, Kelompok B: 5 kancing).",
          "instruksi": "Aku punya dua kelompok kancing di sini. Kelompok yang ini (tunjuk) dan kelompok yang itu (tunjuk). Menurutmu, kelompok mana yang 'lebih banyak' kancingnya? Kenapa?\" (Ulangi dengan \"lebih sedikit\" dan \"sama banyak\" dengan pengaturan objek berbeda).",
          "rubrik": {
            "1": "Tidak Tepat",
            "2": "Ragu/Perlu Mengulang",
            "3": "Tepat"
          },
          "opsi_serupa": [
            {
              "nama": "Mengurutkan Benda Berdasarkan Ukuran/Panjang",
              "deskripsi_aktivitas": "Sediakan 3-4 benda dengan dimensi berbeda (misal: pensil pendek, sedang, panjang; balok kecil, sedang, besar). Minta anak mengurutkannya dari yang terkecil/terpendek ke terbesar/terpanjang atau sebaliknya.",
              "tujuan_opsi": "Mengembangkan pemahaman perbandingan kuantitatif non-numerik."
            },
            {
              "nama": "Permainan Dadu Sederhana (Perbandingan Angka)",
              "deskripsi_aktivitas": "Gunakan dua dadu (atau kartu angka 1-6). Asesor dan anak bergantian melempar/mengambil. Minta anak menyebutkan siapa yang mendapatkan angka \"lebih besar\" atau \"lebih kecil\".",
              "tujuan_opsi": "Menerapkan perbandingan angka dalam konteks permainan."
            }
          ]
        }
      ],
      "max_anak_score": 9
    },
    "ortu": [
      {
        "pertanyaan": "Apakah anak Anda suka menghitung benda-benda di sekitarnya? Sampai berapa ia bisa menghitung?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      },
      {
        "pertanyaan": "Apakah anak Anda tertarik pada pola, seperti pola warna atau bentuk?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      },
      {
        "pertanyaan": "Apakah anak Anda suka memecahkan teka-teki sederhana, puzzle angka, atau mencari tahu bagaimana sesuatu bekerja?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      },
      {
        "pertanyaan": "Apakah anak Anda sering bertanya 'mengapa' atau 'bagaimana'?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      }
    ],
    "max_ortu_score": 4
  },
  "Spasial": {
    "TK": {
      "anak": [
        {
          "aktivitas": "Menggambar Sesuai Instruksi",
          "tujuan": "Mengukur kemampuan memahami instruksi spasial, representasi visual, dan koordinasi motorik halus.",
          "bahan": "Kertas kosong, pensil warna/krayon.",
          "instruksi": "Mari kita menggambar bersama! Aku akan memberitahumu apa yang harus digambar. Dengarkan baik-baik: 'Gambar lingkaran besar di tengah kertas.' (Tunggu anak menggambar). 'Sekarang, gambar segitiga kecil di atas lingkaran.' (Tunggu). 'Lalu, gambar dua kotak kecil di bawah lingkaran.' (Tunggu). Berikan 3-4 instruksi bertahap yang melibatkan bentuk dasar dan posisi relatif.",
          "rubrik": {
            "1": "Coretan/Sulit Membentuk",
            "2": "Ada Bagian Kurang/Tidak Sesuai",
            "3": "Gambar Jelas & Sesuai Instruksi"
          },
          "opsi_serupa": [
            {
              "nama": "Meniru Gambar Model",
              "deskripsi_aktivitas": "Asesor menggambar bentuk atau objek sederhana (misal: rumah dengan jendela dan pintu, pohon dengan dahan) dan meminta anak menirunya di kertas lain.",
              "tujuan_opsi": "Mengukur kemampuan observasi visual dan reproduksi spasial."
            },
            {
              "nama": "Membangun dengan Balok sesuai Contoh",
              "deskripsi_aktivitas": "Asesor membangun struktur sederhana (misal: menara 3 balok, atau jembatan 2 balok) menggunakan balok. Minta anak membuat struktur yang sama persis.",
              "tujuan_opsi": "Mengembangkan pemahaman spasial 3D, perencanaan, dan kemampuan mereplikasi model."
            }
          ]
        },
        {
          "aktivitas": "Menyelesaikan Puzzle",
          "tujuan": "Mengukur penalaran spasial, pemecahan masalah, dan koordinasi mata-tangan.",
          "bahan": "Puzzle gambar sederhana (4-8 keping, sesuai usia TK).",
          "instruksi": "Ini ada puzzle gambar yang cantik. Bisakah kamu menyusunnya menjadi gambar yang utuh?\" (Perhatikan strategi anak, kecepatan, dan apakah mereka mencoba mencocokkan bentuk atau warna). Berikan 1-2 jenis puzzle yang berbeda.",
          "rubrik": {
            "1": "Sulit Menyelesaikan",
            "2": "Butuh Bantuan/Waktu Lama",
            "3": "Mandiri & Cepat"
          },
          "opsi_serupa": [
            {
              "nama": "Memasangkan Bentuk (Shape Sorter)",
              "deskripsi_aktivitas": "Sediakan mainan shape sorter dengan lubang berbagai bentuk dan kepingan bentuk yang sesuai. Minta anak memasukkan kepingan ke lubang yang tepat.",
              "tujuan_opsi": "Mengukur pemahaman bentuk, rotasi mental, dan koordinasi mata-tangan."
            },
            {
              "nama": "Permainan Geometri Sederhana (Tangram)",
              "deskripsi_aktivitas": "Berikan beberapa keping tangram dan minta anak membentuk gambar sederhana (misal: bentuk rumah, kapal) sesuai contoh visual.",
              "tujuan_opsi": "Mengembangkan kemampuan memvisualisasikan dan menggabungkan bentuk geometris."
            }
          ]
        },
        {
          "aktivitas": "Menemukan Benda Tersembunyi",
          "tujuan": "Mengukur pemahaman spasial, kemampuan mengikuti petunjuk verbal, dan pemecahan masalah.",
          "bahan": "Sebuah benda kecil (misal: mainan favorit anak, koin). Area asesmen yang memungkinkan penyembunyian.",
          "instruksi": "Aku punya mainan kecil ini. Aku akan menyembunyikannya, dan kamu harus mencarinya! Tutup matamu ya. (Sembunyikan benda di area yang terlihat namun tidak langsung jelas, misal: di bawah buku, di balik gorden tipis, di dalam kotak mainan). Oke, sudah! Dengarkan petunjukku: 'Carilah di tempat yang ada di meja, dekat dengan buku berwarna biru.' Temukan dia!\" Berikan 2-3 skenario penyembunyian dengan tingkat kesulitan berbeda.",
          "rubrik": {
            "1": "Tidak Menemukan",
            "2": "Perlu Bimbingan/Waktu",
            "3": "Menemukan dengan Cepat"
          },
          "opsi_serupa": [
            {
              "nama": "Permainan \"Di Mana Posisinya?\" (Preposisi)",
              "deskripsi_aktivitas": "Tempatkan sebuah boneka/objek di berbagai posisi relatif terhadap objek lain (misal: di atas meja, di bawah kursi, di samping buku, di depan kotak). Minta anak untuk menyebutkan di mana posisi boneka itu berada.",
              "tujuan_opsi": "Mengukur pemahaman konsep spasial verbal (preposisi)."
            },
            {
              "nama": "Mencari Perbedaan pada Gambar",
              "deskripsi_aktivitas": "Tunjukkan dua gambar yang hampir identik tetapi memiliki 3-5 perbedaan kecil. Minta anak untuk menemukan perbedaan-perbedaan tersebut.",
              "tujuan_opsi": "Melatih kemampuan observasi visual, perhatian terhadap detail spasial, dan diskriminasi."
            }
          ]
        }
      ],
      "max_anak_score": 9
    },
    "ortu": [
      {
        "pertanyaan": "Apakah anak Anda suka menggambar, melukis, atau mewarnai? Seberapa detail atau kreatif gambarnya?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      },
      {
        "pertanyaan": "Apakah anak Anda suka bermain balok, Lego, atau mainan konstruksi lainnya?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      },
      {
        "pertanyaan": "Apakah anak Anda mudah menemukan jalan di tempat baru atau mengingat arah?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      },
      {
        "pertanyaan": "Apakah anak Anda menikmati permainan puzzle atau menemukan perbedaan pada gambar?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      }
    ],
    "max_ortu_score": 4
  },
  "Kinestetik": {
    "TK": {
      "anak": [
        {
          "aktivitas": "Menirukan Gerakan Hewan",
          "tujuan": "Mengukur kesadaran tubuh, koordinasi motorik kasar, keseimbangan, dan ekspresi non-verbal.",
          "bahan": "Tidak ada (mungkin kartu gambar hewan untuk visualisasi).",
          "instruksi": "Mari kita bermain meniru gerakan binatang! Bisakah kamu menirukan aku? Coba tirukan bagaimana 'kucing berjalan' (berjalan merangkak). Lalu, bagaimana 'kelinci melompat' (melompat dengan kedua kaki)? Sekarang, bagaimana 'ular merayap'?\" Berikan 3-5 jenis gerakan hewan yang bervariasi.",
          "rubrik": {
            "1": "Tidak Melakukan/Sulit",
            "2": "Gerakan Kurang Jelas",
            "3": "Gerakan Jelas & Mirip"
          },
          "opsi_serupa": [
            {
              "nama": "Mengikuti Gerakan Tari Sederhana",
              "deskripsi_aktivitas": "Asesor menunjukkan 3-4 gerakan tari sederhana secara berurutan (misal: tepuk tangan 2x, putar badan, lompat 1x). Minta anak mengikutinya.",
              "tujuan_opsi": "Mengukur kemampuan meniru urutan gerakan dan koordinasi tubuh."
            },
            {
              "nama": "Permainan \"Simon Berkata\" (Fokus Gerakan)",
              "deskripsi_aktivitas": "Bermain \"Simon Says\" dengan instruksi gerakan tubuh (misal: \"Simon berkata pegang hidungmu,\" \"Simon berkata lompat satu kaki\").",
              "tujuan_opsi": "Mengembangkan pemahaman instruksi verbal yang melibatkan gerakan dan kontrol motorik."
            }
          ]
        },
        {
          "aktivitas": "Membuat Bentuk dari Plastisin",
          "tujuan": "Mengukur keterampilan motorik halus, kekuatan jari, dan representasi 3D.",
          "bahan": "Plastisin atau play-doh.",
          "instruksi": "Mari kita membuat bentuk dengan plastisin ini! Bisakah kamu membuat 'bola' dari plastisin ini? (Tunggu). Bagus! Sekarang, bisakah kamu membuat 'ular' yang panjang?\" (Berikan 2-3 instruksi bentuk dasar, atau biarkan anak berkreasi bebas).",
          "rubrik": {
            "1": "Hanya Meremas",
            "2": "Bentuk Kurang Jelas",
            "3": "Bentuk Jelas & Sesuai"
          },
          "opsi_serupa": [
            {
              "nama": "Menggunting Garis Sederhana",
              "deskripsi_aktivitas": "Berikan kertas dengan garis lurus dan melengkung tebal yang sudah digambar. Minta anak menggunting mengikuti garis tersebut.",
              "tujuan_opsi": "Mengembangkan keterampilan motorik halus, koordinasi mata-tangan, dan kontrol alat."
            },
            {
              "nama": "Meronce Manik-manik/Memasukkan Pasak",
              "deskripsi_aktivitas": "Sediakan manik-manik besar dan tali tebal, atau papan pasak dengan pasak besar. Minta anak meronce manik-manik/memasukkan pasak.",
              "tujuan_opsi": "Melatih koordinasi mata-tangan dan ketangkasan jari."
            }
          ]
        },
        {
          "aktivitas": "Melakukan Gerakan Sesuai Instruksi (Kompleks)",
          "tujuan": "Mengukur kemampuan pemahaman instruksi motorik kompleks, memori urutan gerak, dan eksekusi motorik.",
          "bahan": "Tidak ada.",
          "instruksi": "Aku akan memberikan tiga perintah gerakan sekaligus. Kamu harus mengingat dan melakukannya secara berurutan. Siap? Dengarkan: 'Angkat tangan kananmu, lalu putar badanmu ke kanan, dan sentuh lutut kirimu.' Ayo, coba lakukan!\" Berikan 2-3 rangkaian instruksi.",
          "rubrik": {
            "1": "Sulit Mengikuti",
            "2": "Ada Kesalahan/Lambat",
            "3": "Melakukan Semua dengan Tepat"
          },
          "opsi_serupa": [
            {
              "nama": "Permainan Melempar dan Menangkap Bola",
              "deskripsi_aktivitas": "Bermain lempar tangkap bola (ukuran anak TK) dengan anak. Amati kemampuan anak melempar dengan target dan menangkap dengan kedua tangan.",
              "tujuan_opsi": "Mengukur koordinasi motorik kasar, akurasi, dan respons."
            },
            {
              "nama": "Berjalan di Garis Lurus (Keseimbangan)",
              "deskripsi_aktivitas": "Gambar garis lurus di lantai (sekitar 2-3 meter). Minta anak berjalan mengikuti garis tersebut tanpa keluar, tumit menyentuh jari kaki di depan.",
              "tujuan_opsi": "Mengukur keseimbangan statis dan dinamis."
            }
          ]
        }
      ],
      "max_anak_score": 9
    },
    "ortu": [
      {
        "pertanyaan": "Apakah anak Anda sangat aktif secara fisik?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      },
      {
        "pertanyaan": "Apakah anak Anda memiliki koordinasi mata-tangan yang baik?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      },
      {
        "pertanyaan": "Apakah anak Anda suka menari atau meniru gerakan dari televisi/orang lain?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      },
      {
        "pertanyaan": "Apakah anak Anda terampil dalam aktivitas yang melibatkan tangan seperti bermain plastisin atau menggunting?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      }
    ],
    "max_ortu_score": 4
  },
  "Musikal": {
    "TK": {
      "anak": [
        {
          "aktivitas": "Menyanyikan Lagu Favorit",
          "tujuan": "Mengukur kemampuan reproduksi melodi, ritme, dan lirik.",
          "bahan": "Tidak ada (opsional: kartu lirik bergambar).",
          "instruksi": "Apakah kamu punya lagu anak-anak favorit? Bisakah kamu menyanyikannya untukku?\" (Jika anak malu, asesor bisa menawarkan untuk menyanyi bersama, atau memulai lagu yang familiar dan meminta anak melanjutkan). Amati nada, ritme, dan kejelasan lirik.",
          "rubrik": {
            "1": "Tidak Mau Bernyanyi",
            "2": "Nada/Ritme Kurang Tepat",
            "3": "Nada & Ritme Cukup Tepat"
          },
          "opsi_serupa": [
            {
              "nama": "Menirukan Melodi Sederhana",
              "deskripsi_aktivitas": "Asesor menyanyikan/memainkan melodi sederhana (3-5 nada, misal: Do-Re-Mi) dengan suara atau alat musik sederhana (pianika, xylophone). Minta anak menirukan melodi tersebut.",
              "tujuan_opsi": "Mengukur diskriminasi nada dan reproduksi melodi."
            },
            {
              "nama": "Melengkapi Lirik Lagu Familiar",
              "deskripsi_aktivitas": "Asesor menyanyikan lagu anak-anak yang familiar, berhenti di bagian tertentu. Minta anak melanjutkan liriknya.",
              "tujuan_opsi": "Mengukur memori lagu dan pemahaman lirik."
            }
          ]
        },
        {
          "aktivitas": "Mengenali Suara Binatang",
          "tujuan": "Mengukur diskriminasi aural, kemampuan mengidentifikasi sumber suara, dan perbendahargaan kata terkait suara.",
          "bahan": "Rekaman suara binatang/lingkungan familiar (misal: kucing, anjing, ayam, sapi, hujan, klakson mobil, bel pintu).",
          "instruksi": "Dengarkan baik-baik. Aku akan memutarkan suara, bisakah kamu menebak suara apa ini?\" Putar rekaman suara satu per satu. Berikan 5-7 suara berbeda.",
          "rubrik": {
            "1": "Sulit Mengidentifikasi",
            "2": "Ada Kesalahan/Ragu",
            "3": "Mengidentifikasi Semua dengan Benar"
          },
          "opsi_serupa": [
            {
              "nama": "Membedakan Kekerasan Suara (Dinamika)",
              "deskripsi_aktivitas": "Asesor membuat berbagai suara (misal: tepukan tangan keras, bisikan pelan, ketukan sedang). Minta anak mengidentifikasi apakah suara tersebut \"keras\", \"pelan\", atau \"sedang\".",
              "tujuan_opsi": "Mengukur pemahaman dinamika suara."
            },
            {
              "nama": "Mengidentifikasi Alat Musik dari Suara",
              "deskripsi_aktivitas": "Perdengarkan suara alat musik sederhana (misal: drum, gitar, piano, marakas). Minta anak menebak nama alat musik tersebut.",
              "tujuan_opsi": "Mengukur pengenalan timbre alat musik."
            }
          ]
        },
        {
          "aktivitas": "Mengikuti Pola Ketukan/Irama",
          "tujuan": "Mengukur kemampuan diskriminasi ritme, reproduksi ritme, dan koordinasi motorik-auditori.",
          "bahan": "Tidak ada (opsional: alat perkusi sederhana seperti tamborin atau stik).",
          "instruksi": "Sekarang kita akan bermain menirukan ketukan. Aku akan membuat pola ketukan dengan tanganku, lalu kamu tirukan persis sama. Siap? Ini dia: (Asesor membuat pola ketukan: 'tap-tap-jeda-tap'). Coba kamu tirukan!\" Berikan 3-5 pola ketukan dengan kompleksitas meningkat.",
          "rubrik": {
            "1": "Sulit Mengikuti",
            "2": "Tidak Konsisten",
            "3": "Mengikuti Pola dengan Akurat"
          },
          "opsi_serupa": [
            {
              "nama": "Merespons Irama Musik dengan Gerakan",
              "deskripsi_aktivitas": "Putar musik dengan ritme yang jelas (misal: lagu anak-anak dengan tempo bervariasi). Minta anak untuk bergerak, menari, atau menghentakkan kaki mengikuti irama musik tersebut.",
              "tujuan_opsi": "Mengukur respons tubuh terhadap ritme dan tempo musik."
            },
            {
              "nama": "Eksplorasi Suara dengan Benda",
              "deskripsi_aktivitas": "Sediakan beberapa benda yang bisa menghasilkan suara (misal: sendok, gelas, kunci, buku). Minta anak mengeksplorasi suara yang dihasilkan dan membuat \"lagu\" sederhana dengan pola suara.",
              "tujuan_opsi": "Mendorong eksplorasi musikal, kreativitas ritme, dan pemahaman properti suara."
            }
          ]
        }
      ],
      "max_anak_score": 9
    },
    "ortu": [
      {
        "pertanyaan": "Apakah anak Anda suka bernyanyi atau bersenandung, bahkan saat sendirian?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      },
      {
        "pertanyaan": "Apakah anak Anda peka terhadap irama musik?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      },
      {
        "pertanyaan": "Apakah anak Anda bisa membedakan berbagai jenis suara?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      },
      {
        "pertanyaan": "Apakah anak Anda menunjukkan minat pada alat musik atau mencoba membuat suara musikal?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      }
    ],
    "max_ortu_score": 4
  },
  "Interpersonal": {
    "TK": {
      "anak": [
        {
          "aktivitas": "Mengenali Ekspresi Wajah & Emosi",
          "tujuan": "Mengukur kemampuan memahami isyarat non-verbal dan empati dasar.",
          "bahan": "Kartu gambar dengan ekspresi wajah dasar (senang, sedih, marah, takut, terkejut).",
          "instruksi": "Lihat gambar-gambar wajah ini. Bisakah kamu memberitahuku, bagaimana perasaan orang di gambar ini? (Tunjuk satu per satu).\" (Jika anak kesulitan, asesor bisa menirukan ekspresi wajah dan meminta anak menebak atau menjelaskan). Berikan 5 ekspresi berbeda.",
          "rubrik": {
            "1": "Sulit Mengidentifikasi",
            "2": "Ada Kesalahan/Ragu",
            "3": "Mengidentifikasi Semua dengan Tepat"
          },
          "opsi_serupa": [
            {
              "nama": "Membedakan Suara Emosi",
              "deskripsi_aktivitas": "Asesor mengeluarkan suara yang menunjukkan emosi (misal: \"Hmmph!\" (marah), \"Hiks hiks\" (sedih), \"Hore!\" (senang)). Minta anak menebak perasaan apa yang ditunjukkan suara tersebut.",
              "tujuan_opsi": "Mengukur pemahaman isyarat vokal emosional."
            },
            {
              "nama": "Sketsa Skenario Emosional Sederhana",
              "deskripsi_aktivitas": "Ceritakan situasi sederhana yang memicu emosi (misal: \"Bonekamu jatuh dan kotor. Bagaimana perasaan bonekamu?\"). Minta anak menebak perasaan karakter.",
              "tujuan_opsi": "Mendorong empati dan menghubungkan situasi dengan emosi."
            }
          ]
        },
        {
          "aktivitas": "Sketsa Skenario Sosial & Solusi",
          "tujuan": "Mengukur empati, kemampuan memecahkan masalah sosial sederhana, dan pemahaman perilaku prososial.",
          "bahan": "Tidak ada.",
          "instruksi": "Aku punya beberapa cerita kecil. Coba dengarkan, lalu kamu ceritakan apa yang akan kamu lakukan. Oke? Skenario 1: 'Temanmu menangis karena mainannya rusak. Apa yang akan kamu lakukan untuk temanmu?' Skenario 2: 'Kamu dan temanmu ingin bermain dengan mainan yang sama. Apa yang bisa kalian lakukan agar bisa bermain bersama?'\" Berikan 2-3 skenario yang berbeda.",
          "rubrik": {
            "1": "Tidak Peduli",
            "2": "Jawaban Kurang Optimal",
            "3": "Jawaban Empati/Solusi Positif"
          },
          "opsi_serupa": [
            {
              "nama": "Bermain Peran \"Berbagi/Membantu\"",
              "deskripsi_aktivitas": "Asesor dan anak bermain peran di mana salah satu membutuhkan bantuan atau ingin berbagi mainan. Amati bagaimana anak merespons permintaan atau menawarkan bantuan/berbagi.",
              "tujuan_opsi": "Melatih keterampilan berbagi, menolong, dan negosiasi sosial secara konkret."
            },
            {
              "nama": "Mengidentifikasi Perilaku \"Baik\" dan \"Tidak Baik\"",
              "deskripsi_aktivitas": "Tunjukkan gambar atau ceritakan situasi yang menggambarkan perilaku \"baik\" (misal: menolong teman yang jatuh) dan \"tidak baik\" (misal: merebut mainan). Minta anak mengidentifikasi mana yang baik/tidak baik dan mengapa.",
              "tujuan_opsi": "Mengembangkan pemahaman norma sosial, moralitas, dan konsekuensi perilaku."
            }
          ]
        },
        {
          "aktivitas": "Bermain Peran Sederhana",
          "tujuan": "Mengukur kemampuan interaksi sosial, komunikasi, dan memahami peran.",
          "bahan": "Beberapa properti sederhana yang sesuai dengan peran (misal: stetoskop mainan untuk dokter, apron untuk koki).",
          "instruksi": "Kita akan bermain peran! Kamu mau jadi apa? Dokter? Guru? Atau koki? Aku akan jadi pasien/murid/pembeli. Ayo kita mulai!\" (Fasilitasi permainan peran, perhatikan bagaimana anak berinteraksi, berkomunikasi, dan mempertahankan perannya). Berikan 1-2 skenario bermain peran.",
          "rubrik": {
            "1": "Sulit Berinteraksi",
            "2": "Perlu Bimbingan",
            "3": "Berinteraksi Aktif & Sesuai Peran"
          },
          "opsi_serupa": [
            {
              "nama": "Bermain Kelompok Kecil (Observasi)",
              "deskripsi_aktivitas": "Asesor mengamati anak saat bermain bebas di kelompok kecil (2-3 anak lain, jika memungkinkan). Amati bagaimana anak berinteraksi, berbagi, bernegosiasi, dan menyelesaikan konflik (jika ada).",
              "tujuan_opsi": "Mengukur keterampilan sosial dalam konteks alami."
            },
            {
              "nama": "Memberi Pujian/Dukungan",
              "deskripsi_aktivitas": "Asesor menunjukkan gambar anak lain yang berhasil melakukan sesuatu (misal: membangun menara tinggi, menggambar bagus). Minta anak untuk memberikan pujian atau kata-kata penyemangat.",
              "tujuan_opsi": "Melatih kemampuan memberikan dukungan sosial dan apresiasi."
            }
          ]
        }
      ],
      "max_anak_score": 9
    },
    "ortu": [
      {
        "pertanyaan": "Apakah anak Anda mudah berteman atau berinteraksi dengan anak-anak lain?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      },
      {
        "pertanyaan": "Bagaimana anak Anda bereaksi ketika melihat orang lain sedih/marah?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      },
      {
        "pertanyaan": "Apakah anak Anda suka bermain kelompok atau berbagi mainan?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      },
      {
        "pertanyaan": "Apakah anak Anda cenderung menjadi pemimpin atau pengikut dalam permainan?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      }
    ],
    "max_ortu_score": 4
  },
  "Intrapersonal": {
    "TK": {
      "anak": [
        {
          "aktivitas": "Memilih Kegiatan Kesukaan & Memberi Alasan",
          "tujuan": "Mengukur kesadaran diri, preferensi pribadi, dan kemampuan merefleksikan minat.",
          "bahan": "Kartu gambar berbagai kegiatan anak (misal: menggambar, bermain balok, mendengarkan cerita, bermain plastisin, menyanyi).",
          "instruksi": "Lihat gambar-gambar kegiatan ini. Kegiatan mana yang paling kamu sukai? Mengapa kamu suka kegiatan itu?\" (Biarkan anak memilih 1-2 kegiatan dan tanyakan alasannya).",
          "rubrik": {
            "1": "Sulit Memilih",
            "2": "Alasan Sederhana",
            "3": "Memilih & Memberi Alasan Jelas"
          },
          "opsi_serupa": [
            {
              "nama": "Mengidentifikasi Perasaan Diri Saat Ini",
              "deskripsi_aktivitas": "Tanyakan kepada anak, \"Bagaimana perasaanmu sekarang?\" atau \"Apa yang membuatmu senang/sedih hari ini?\". Asesor dapat menunjukkan kartu ekspresi wajah untuk membantu anak mengekspresikan.",
              "tujuan_opsi": "Mengukur kesadaran akan emosi diri yang sedang dirasakan."
            },
            {
              "nama": "Ini Aku Suka!\" (Menunjukkan Objek Favorit)",
              "deskripsi_aktivitas": "Minta anak untuk menunjukkan atau menyebutkan benda atau mainan favoritnya dan menjelaskan mengapa itu menjadi favorit.",
              "tujuan_opsi": "Mengukur kemampuan mengidentifikasi dan memvalidasi preferensi pribadi."
            }
          ]
        },
        {
          "aktivitas": "Mengungkapkan Perasaan (Terkait Skenario)",
          "tujuan": "Mengukur kemampuan mengidentifikasi dan mengartikulasikan emosi diri dalam konteks hipotetis.",
          "bahan": "Tidak ada.",
          "instruksi": "Aku punya beberapa pertanyaan tentang perasaanmu. Coba dengarkan: 'Bagaimana perasaanmu kalau kamu dapat hadiah yang paling kamu inginkan?' Atau 'Bagaimana perasaanmu kalau mainan kesayanganmu rusak?'\" Berikan 2-3 skenario yang memicu emosi dasar.",
          "rubrik": {
            "1": "Sulit Mengungkapkan",
            "2": "Kurang Jelas",
            "3": "Mengungkapkan Jelas & Memberi Alasan"
          },
          "opsi_serupa": [
            {
              "nama": "Bercerita Tentang Hari Baik/Buruk",
              "deskripsi_aktivitas": "Minta anak untuk menceritakan tentang \"hari yang sangat menyenangkan\" atau \"hari yang sedikit sedih\" yang pernah dialami, dan bagaimana perasaannya saat itu.",
              "tujuan_opsi": "Melatih kemampuan merefleksikan pengalaman pribadi dan mengaitkannya dengan emosi."
            },
            {
              "nama": "Melengkapi Kalimat \"Aku Merasa...\"",
              "deskripsi_aktivitas": "Asesor memulai kalimat: \"Aku merasa senang ketika...\" atau \"Aku merasa sedih kalau...\" dan meminta anak melengkapinya.",
              "tujuan_opsi": "Mendorong ekspresi emosi dalam struktur bahasa."
            }
          ]
        },
        {
          "aktivitas": "Apa yang Membuatmu Bangga?",
          "tujuan": "Mengukur harga diri, pengakuan terhadap pencapaian pribadi, dan motivasi diri.",
          "bahan": "Tidak ada.",
          "instruksi": "Apa yang pernah kamu lakukan yang membuatmu merasa sangat bangga? Atau, apa yang membuatmu senang dengan dirimu sendiri?\" (Berikan contoh sederhana jika anak kesulitan: \"Dulu aku bangga sekali waktu aku bisa mengikat tali sepatuku sendiri. Kamu pernah bangga waktu apa?\")",
          "rubrik": {
            "1": "Tidak Ada",
            "2": "Sederhana",
            "3": "Pengalaman Membanggakan"
          },
          "opsi_serupa": [
            {
              "nama": "Mengidentifikasi Kekuatan Diri (\"Aku Hebat Karena...\")",
              "deskripsi_aktivitas": "Tanyakan kepada anak, \"Apa yang kamu jago lakukan?\" atau \"Apa yang bisa kamu lakukan dengan sangat baik?\"",
              "tujuan_opsi": "Mengembangkan kesadaran akan kemampuan dan kekuatan pribadi."
            },
            {
              "nama": "Menggambar Diri Sendiri Melakukan Hal yang Disukai/Dibanggakan",
              "deskripsi_aktivitas": "Minta anak menggambar diri mereka sedang melakukan aktivitas yang sangat mereka sukai atau yang membuat mereka merasa senang dan bangga.",
              "tujuan_opsi": "Mengekspresikan minat dan identitas diri secara visual dan refleksi diri."
            }
          ]
        }
      ],
      "max_anak_score": 9
    },
    "ortu": [
      {
        "pertanyaan": "Apakah anak Anda suka bermain sendiri dan fokus pada aktivitasnya?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      },
      {
        "pertanyaan": "Apakah anak Anda bisa mengungkapkan perasaannya sendiri?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      },
      {
        "pertanyaan": "Apakah anak Anda tahu apa yang ia suka dan tidak suka?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      },
      {
        "pertanyaan": "Apakah anak Anda memiliki cita-cita atau keinginan yang kuat?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      }
    ],
    "max_ortu_score": 4
  },
  "Naturalis": {
    "TK": {
      "anak": [
        {
          "aktivitas": "Mengidentifikasi Hewan & Tumbuhan Umum",
          "tujuan": "Mengukur pengetahuan dasar tentang flora dan fauna, serta kemampuan klasifikasi alam.",
          "bahan": "Kartu gambar hewan dan tumbuhan umum (misal: kucing, anjing, burung, ikan, gajah, pohon, bunga, rumput).",
          "instruksi": "Kita akan melihat gambar-gambar ini. Bisakah kamu memberitahuku, ini gambar hewan apa?\" (Tunjuk satu per satu). Lanjutkan dengan beberapa gambar tumbuhan. Berikan 5-7 gambar kombinasi.",
          "rubrik": {
            "1": "Sulit Mengidentifikasi",
            "2": "Ada Kesalahan/Ragu",
            "3": "Mengidentifikasi Sebagian Besar"
          },
          "opsi_serupa": [
            {
              "nama": "Menirukan Suara/Gerakan Hewan (Naturalis Fokus)",
              "deskripsi_aktivitas": "Asesor menyebutkan nama hewan, dan anak diminta menirukan suara atau gerakan spesifik hewan tersebut (fokus pada ciri khas alami).",
              "tujuan_opsi": "Mengukur pengetahuan tentang karakteristik alami hewan dan kemampuan menirunya."
            },
            {
              "nama": "Mengelompokkan Benda Hidup dan Mati (Dengan Alasan)",
              "deskripsi_aktivitas": "Sediakan objek (daun, batu, bunga, mainan, pensil). Minta anak mengelompokkan menjadi \"hidup\" dan \"mati\" dan jelaskan alasannya (misal: \"Daun hidup karena bisa tumbuh\").",
              "tujuan_opsi": "Mengembangkan pemahaman konsep dasar biologi dan kemampuan mengklasifikasi."
            }
          ]
        },
        {
          "aktivitas": "Mengenali Suara Alam & Fenomena Alam",
          "tujuan": "Mengukur diskriminasi aural terkait alam, pengenalan fenomena alam, dan pemahaman lingkungan.",
          "bahan": "Rekaman suara alam (misal: hujan, angin, air mengalir, burung berkicau, guntur).",
          "instruksi": "Sekarang kita akan mendengarkan suara dari alam. Coba tebak, suara apa ini?\" Putar rekaman suara satu per satu. Berikan 5-7 suara berbeda.",
          "rubrik": {
            "1": "Sulit Mengidentifikasi",
            "2": "Ada Kesalahan/Ragu",
            "3": "Mengidentifikasi Semua dengan Benar"
          },
          "opsi_serupa": [
            {
              "nama": "Mengamati & Menjelaskan Cuaca",
              "deskripsi_aktivitas": "Ajak anak ke dekat jendela atau luar ruangan (jika aman). Tanyakan: \"Bagaimana cuaca hari ini? Apa yang kamu lihat/rasakan?\"",
              "tujuan_opsi": "Mengembangkan kemampuan observasi fenomena alam dan verbalisasi."
            },
            {
              "nama": "Menggambar Pemandangan Alam Favorit",
              "deskripsi_aktivitas": "Minta anak menggambar pemandangan alam yang mereka sukai (misal: gunung, pantai, hutan, taman).",
              "tujuan_opsi": "Mengekspresikan apresiasi terhadap alam dan representasi visual lingkungan."
            }
          ]
        }
      ],
      "max_anak_score": 6
    },
    "ortu": [
      {
        "pertanyaan": "Apakah anak Anda suka berada di luar ruangan, seperti di taman atau kebun?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      },
      {
        "pertanyaan": "Apakah anak Anda tertarik pada hewan atau tumbuhan?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      },
      {
        "pertanyaan": "Apakah anak Anda suka bertanya tentang fenomena alam?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      },
      {
        "pertanyaan": "Apakah anak Anda menunjukkan kepedulian terhadap lingkungan atau makhluk hidup?",
        "rubrik": {
          "0": "Tidak",
          "1": "Ya"
        }
      }
    ],
    "max_ortu_score": 4
  }
}